dist/guia-virtualizacion/docker.html
<!--?xml version="1.0" encoding="utf-8"?--><!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en"><head>
<!-- 2021-10-19 mar 03:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Guia Virtualización - Docker</title>
<meta name="generator" content="Org mode">
<meta name="author" content="jelou">
<link rel="stylesheet" type="text/css" href="/assets/css/style.css">
<link rel="stylesheet" type="text/css" href="/assets/css/sass-style.css">
</head>
<body>
<div id="content">
<h1 class="title">Guia Virtualización - Docker</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdcdd97d">1. Docker</a>
<ul>
<li><a href="#orgef04766">1.1. Conceptos</a>
<ul>
<li><a href="#org6266b88">1.1.1. Imagen</a></li>
<li><a href="#org86daaed">1.1.2. Contenedor</a></li>
</ul>
</li>
<li><a href="#orgd440764">1.2. Instalación</a></li>
<li><a href="#orgb51eae7">1.3. Comandos básicos</a>
<ul>
<li><a href="#org2c51c39">1.3.1. Lista de Comandos</a></li>
<li><a href="#orgb3325ab">1.3.2. Referencias</a></li>
<li><a href="#orge10652c">1.3.3. Lista de parámetros</a></li>
<li><a href="#org00bf698">1.3.4. Observaciones importantes</a></li>
<li><a href="#org593a018">1.3.5. Crear Contenedores en primer y segundo plano</a></li>
<li><a href="#orgddd7d42">1.3.6. Crear Imagenes</a></li>
<li><a href="#org0b9b088">1.3.7. Eliminar multiples Contenedores</a></li>
<li><a href="#org4da6f51">1.3.8. Eliminar multiples imagenes</a></li>
<li><a href="#orgee42985">1.3.9. Descargar ó Actualizar un Contenedor</a></li>
<li><a href="#org1e2d584">1.3.10. Listar contenedores en ejecución e inactivos</a></li>
<li><a href="#org0f60065">1.3.11. Acceder ó Iniciar/Detener ejecución de contenedores</a></li>
<li><a href="#org4be0f0c">1.3.12. Versionar containers</a></li>
<li><a href="#org8017249">1.3.13. Abrir Puertos</a></li>
<li><a href="#org69166b6">1.3.14. Referencias Web Extraoficiales</a></li>
</ul>
</li>
<li><a href="#org371086b">1.4. Estados</a></li>
<li><a href="#org1ef6190">1.5. Configurando Puertos</a></li>
<li><a href="#orgcc4c4d9">1.6. Configurando Volumenes</a>
<ul>
<li><a href="#orgb3ff470">1.6.1. Conceptos</a></li>
<li><a href="#orged0fd80">1.6.2. Ejemplos</a></li>
<li><a href="#org6ef4c8f">1.6.3. Referencias Youtube</a></li>
</ul>
</li>
<li><a href="#org8a8db60">1.7. Probando Distribuciones Linux</a>
<ul>
<li><a href="#orgbbc5884">1.7.1. Probando Alpine Edge</a></li>
<li><a href="#org0de71cb">1.7.2. Probando Debian Buster</a></li>
<li><a href="#org7f20519">1.7.3. Probando Ubuntu Trusty</a></li>
<li><a href="#org9f291ff">1.7.4. Ubuntu</a></li>
</ul>
</li>
<li><a href="#org9b432a8">1.8. Configurando Redes Docker</a>
<ul>
<li><a href="#orgef7b8e2">1.8.1. Conceptos</a></li>
<li><a href="#orgef4af8a">1.8.2. Crear Red</a></li>
<li><a href="#org2f793b6">1.8.3. Referencias</a></li>
</ul>
</li>
<li><a href="#orgbd1adf0">1.9. Ejemplos</a></li>
<li><a href="#org723eb1f">1.10. Referencias</a>
<ul>
<li><a href="#org0d1443b">1.10.1. Referencias Web Extraoficiales</a></li>
<li><a href="#org1c3378f">1.10.2. Referencias Issues</a></li>
<li><a href="#org9b8ab44">1.10.3. Referencias Youtube</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org372018c">2. Dockerfile</a>
<ul>
<li><a href="#org1ddf6c6">2.1. Conceptos</a></li>
<li><a href="#orgd2f6f50">2.2. Comandos básicos</a>
<ul>
<li><a href="#orga661aa3">2.2.1. (BUILD) Crear Imagen</a></li>
<li><a href="#orga76df77">2.2.2. (COPY) Copiar archivos</a></li>
<li><a href="#org61585b1">2.2.3. (ADD) Descargar y Descomprimir archivos</a></li>
<li><a href="#org4688a30">2.2.4. (ENTRYPOINT) Pasar scripts por parámetro</a></li>
<li><a href="#org10061df">2.2.5. (CMD) Comandos por defecto</a></li>
<li><a href="#orgb1dbeec">2.2.6. (RUN) Ejecutar comandos</a></li>
</ul>
</li>
<li><a href="#orge7188c1">2.3. Ejemplos</a></li>
</ul>
</li>
<li><a href="#org52bb493">3. Docker Compose</a>
<ul>
<li><a href="#org7030f36">3.1. Conceptos</a></li>
<li><a href="#org9977f85">3.2. Instalación y Configuración</a></li>
<li><a href="#orgca1605b">3.3. Comandos Básicos</a></li>
<li><a href="#orgf20b43c">3.4. Ejemplos</a></li>
<li><a href="#org3384603">3.5. Referencias</a>
<ul>
<li><a href="#org34cded0">3.5.1. Referencias Web Oficiales</a></li>
<li><a href="#orgf7f8751">3.5.2. Referencias Youtube</a></li>
<li><a href="#org3f1e9e9">3.5.3. Issues Comunes</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb7654c8">4. Docker Tips</a>
<ul>
<li><a href="#orged20ca1">4.1. Ejecutar contenedores al iniciar el sistema</a></li>
<li><a href="#org71cbf31">4.2. Conocer el timestamp de los logs</a></li>
</ul>
</li>
<li><a href="#org2d4ac57">5. Servicios Básicos</a>
<ul>
<li><a href="#orgddeca2d">5.1. Nginx</a></li>
<li><a href="#org8e5bc7e">5.2. Duckdns</a>
<ul>
<li><a href="#orgeedabef">5.2.1. Conceptos</a></li>
<li><a href="#org95154af">5.2.2. Referencias</a></li>
</ul>
</li>
<li><a href="#org2c64158">5.3. Inspircd</a>
<ul>
<li><a href="#org4f9f753">5.3.1. Conceptos</a></li>
<li><a href="#org06f2976">5.3.2. Referencias Web Oficiales</a></li>
<li><a href="#orgecf86aa">5.3.3. Referencias Youtube</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6d97046">6. Glosario</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgdcdd97d" class="outline-2">
<h2 id="orgdcdd97d"><span class="section-number-2">1.</span> Docker</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgef04766" class="outline-3">
<h3 id="orgef04766"><span class="section-number-3">1.1.</span> Conceptos</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org6266b88" class="outline-4">
<h4 id="org6266b88"><span class="section-number-4">1.1.1.</span> Imagen</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>Es como una plantilla que se usa de modelo para crear <b>contenedores</b></li>
<li>Pueden crearse varios contenedores a partir de una imagen</li>
<li>No se pueden modificar</li>
</ul>
</div>
</div>
<div id="outline-container-org86daaed" class="outline-4">
<h4 id="org86daaed"><span class="section-number-4">1.1.2.</span> Contenedor</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>Se crean a partir de una imagen</li>
<li>Puede ser una aplicación, un sistema operativo, …</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd440764" class="outline-3">
<h3 id="orgd440764"><span class="section-number-3">1.2.</span> Instalación</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-shell" id="org40ea3ac"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">en manjaro</span>
sudo pacman -S docker
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">en ubuntu</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">apt install docker</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Create the docker group.</span>
sudo groupadd docker
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Add your user to the docker group.</span>
sudo usermod -aG docker $<span style="color: #4f97d7;">{</span><span style="color: #7590db;">USER</span><span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">relogear ò reiniciar</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">verificamos si anda</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">descargando la imagen de hello-world</span>
docker run hello-world
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell" id="org0723866"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">para listar los contenedores en ejecución</span>
docker ps

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">para correr o descargar &amp;&amp; instalar una version ligera de linux con el tag 3.12</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- Si ya teniamos la imagen de la distribución Alpine, se creará un nuevo contenedor</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">por cada vez que ejecutemos esta linea</span>
docker run alpine:3.12
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">podemos asignar un nombre a cada nuevo contenedor</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- facilita tener varios contenedores de la misma distribución</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- nos evitamos utilizar los ID de los contenedores, y usar solo el nombre</span>
docker run --name miLinux alpine:3.12

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">iniciar en modo "interactivo" en la terminal al contenedor alpine</span>
docker exec -it alpine:3.12 sh
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">si el contenedor tenia algun nombre</span>
docker exec -it miLinux sh
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">para listar archivos de la imagen</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">seguido al nombre del container y del tag, puedo mandarle comandos al container</span>
docker exec alpine:3.12 ls -l

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">muestra los containers instalados</span>
docker image ls | head
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">muestra los ultimos comandos de todos los containers (y su hash en la 1ra columna para versionar)</span>
docker ps -a | head

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">comitear un container (suponiendo que copiaste el hash al ejecutar "docker ps -a")</span>
docker commit elHashDelContainer
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">podemos verlo (copiamos el id)</span>
docker image ls | head
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">le asignamos un tag para diferenciar (suponiendo que asdasd123123 es el id)</span>
docker image tag asdasd123123 miPrimerDocker
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb51eae7" class="outline-3">
<h3 id="orgb51eae7"><span class="section-number-3">1.3.</span> Comandos básicos</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>El parámetro <code>ps</code> es como en linux normal, muestra los procesos en ejecución por tanto mostrará los containers activos (en ejecución)</li>
</ul>
</div>
