src/org-files/guia-virtualizacion/docker.org
*** Lista de Comandos
   #+name: docker-lista-comandos
   |------------------------------------------+-------------------------------------------------------------------------|
   | Comando                                  | Descripción                                                             |
   |------------------------------------------+-------------------------------------------------------------------------|
   | docker start                             |                                                                         |
   | docker stop                              |                                                                         |
   | docker restart                           |                                                                         |
   | docker images                            |                                                                         |
   | docker run                               |                                                                         |
   | docker exec                              |                                                                         |
   |------------------------------------------+-------------------------------------------------------------------------|
   | docker search algunContainer             | Buscar un container                                                     |
   | docker images                            | Listar containers ya instalados (entorno local)                         |
   | docker ps                                | Listar containers en ejecución                                          |
   | docker ps -a # -all                      | Listar (all) todos los containers (activos/inactivos)                   |
   | docker ps -l # -list                     | Listar (list) últimos containers creados                                |
   | docker restart IDdeAlgun                 | Reiniciar un container (como si reiniciaras la maquina y sus servicios) |
   | docker start IDdeAlgunContainer          | Iniciar el Container como proceso(y sus servicios)                      |
   | docker stop IDdeAlgunContainer           | Detiene el Container como proceso(y sus servicios)                      |
   | docker exec IdDeAlgunContainer           | Ejecuta un comando en un container (NO CREA UNO NUEVO)                  |
   | docker run algunContainer algunComando   | Para ejecutar una linea comandos (y crea otro container)                |
   | docker rm -f IDdeAlgunContainer          | Para eliminar un container                                              |
   | docker rmi IDdeAlgunaImagen              | Para eliminar una imagen                                                |
   | docker run -it algunContainer /bin/bash  | Modo interactivo (via terminal) (Y CREA OTRO CONTAINER)                 |
   | docker exec -it algunContainer /bin/bash | Modo Interactivo (via terminal  (NO CREA UNO NUEVO)                     |
   | docker pull algunContainer               | Descargar o actualizarlo                                                |
   | docker pull algunContainer:unTag         | El tag puede ser una version especifica                                 |
   |------------------------------------------+-------------------------------------------------------------------------|
   | docker inspect IDdeAlgunContainer        | Da información COMPLETA en formato JSON                                 |
   | docker rm $(docker ps -a -q)             | Remover todos los contenedores detenido                                 |
   | docker rm $(docker images -q)            | Remover todas las imagenes                                              |
   | docker kill $(docker ps -q)              | Mata el proceso de todos los contenedores en ejecución                  |
   |------------------------------------------+-------------------------------------------------------------------------|
*** Referencias
**** Referencias Web Oficiales
    1. [[https://docs.docker.com/engine/reference/commandline/container_prune/][Comando container prune - Docs, Docker.com]]
**** Referencias Web Extraoficiales
    1. [[https://www.digitalocean.com/community/tutorials/como-instalar-y-usar-docker-en-ubuntu-18-04-1-es][Instalar Docker en Ubuntu - Digitalocean.com]]
    2. [[https://www.ionos.es/digitalguide/servidores/configuracion/tutorial-docker-instalacion-y-primeros-pasos/][Instalación de Docker - Ionos.es]]
    3. [[https://platzi.com/blog/desplegar-contenedores-docker/][Desplegar contenedores - platzi.com]]
    4. [[https://pandorafms.com/blog/es/docker-run/][Docker run - pandorafms.com]]
    5. [[https://linuxize.com/post/how-to-remove-docker-images-containers-volumes-and-networks/][Eliminar imagenes/contenedores/volumenes/conexiones de Docker - Linuxsize.com]]
    6. [[https://kubernetes.io/docs/tasks/configure-pod-container/pull-image-private-registry/][Hacer pull de una imagen de un repositorio privado - Kubernetes.io]]
*** Lista de parámetros
    #+name: docker-lista-parametros
    |-------------+-----------------+-----------------------------------------------------------------------|
    | Parametro   | Forma Abreviada | Descripción                                                           |
    |-------------+-----------------+-----------------------------------------------------------------------|
    | detach      | d               | Correr contenedor en segundo plano                                    |
    | tty         | t               | (tty) Asigna una pseudo terminal al proceso                           |
    | interactive | i               | (STDIN) Mantiene el buffer de entrada abierto                         |
    |             | it              | Combinamos los parámetros para interactuar con con una pseudoterminal |
    | port        | p               | Abrir puertos del contenedor                                          |
    | publish     | (?)             |                                                                       |
    | volume      | v               | (Volumenes) Compartir directorios en el contenedor                    |
    | mount       |                 |                                                                       |
    |             |                 |                                                                       |
    | link        |                 | Enlaza un contenedor con otro (ideal para servidores web)             |
    |-------------+-----------------+-----------------------------------------------------------------------|
