src/org-files/guia-virtualizacion/docker.org
*** Observaciones importantes
    + Si queremos acceder al container (NO CREAR UNO NUEVO) usamos ~docker exec -it IDdeAlgunaImagen bash~ (/si usamos run se creará un nuevo container/)
    + Siempre se crea un contenedor distinto cuando ejecutas una imagen con ~docker run -it IdAlgunaImagen bash~
    + Podemos usar el comando ~docker run -it IDdeAlgunaImagen bash~ para crear un nuevo contenedor
    + Si queremos guardar cambios de un container, podemos versionarlo comiteando y pusheando los cambios en algun repositorio
     
    #+name: docker-crear-imagen
    #+BEGIN_EXAMPLE
      Supongamos que tenemos un container de un ubuntu trusty (14.04) que ya tiene varios packages porque es el que usamos
      (Ej. haskell, prolog, git, etc...) pero queremos probar un nuevo package o configuración
      como sería instalar mysql, mongodb, etc.. sin que se vea afectado el que solemos usar.
      Osea queremos uno de prueba, que sea idéntico al que usamos, donde instalemos cosas o probemos configuraciones del sistema operativo.
      
      Entonces podemos correr el comando "docker run -it nombreImagen" para crear un nuevo container que tiene
      lo mismo que al que apuntamos con el ID, si no funciona lo que queriamos instalar o no era
      lo que necesitabamos borramos ese nuevo container y nos quedamos con el anterior
      
      Observaciones:
      Si estamos diciendo que esa imagen ya dispone de varios programas que nosotros instalamos,
      es porque nosotros previamente hicimos un build de una imagen que disponga esos programas.
      Para más información nos toca investigar sobre Dockerfile.
    #+END_EXAMPLE
*** Crear Contenedores en primer y segundo plano
**** Conceptos
    - Para crear contenedores que corran en segundo plano pasamos el parámetro ~-d~ al comando ~docker run~
    - Para ejecutar contenedores que corran en segundo plano pasamos el parámetro ~-d~ al comando ~docker exec~

    #+name: docker-diferencias-primer-segundo-plano
    #+BEGIN_QUOTE
    Al crear un contenedor en segundo plano, se ejecutará de fondo (osea por detrás de la terminal)
    de donde ejecutemos el comando ~docker run~, pudiendo seguir utilizando esa terminal donde lo ejecutamos.
    (particularmente útil para correr servidores linux, base de datos, ....)

    Si no lo creamos en segundo plano, nos aparecerá en la terminal el resultado de ejecutar el contenedor.
    Si el contenedor era un servidor linux ó una base de datos, el ciclo de ciclo de vida del contenedor finalizará
    luego de ejecutar el sevidor o la base de datos.
    Sería como encenderlo, y luego apagarlo, sin poder darle uso. Teniendo que iniciar el contenedor nuevamente.

    Es decir si creamos un contenedor en primer plano (no le pasamos el parámetro -d)
    que ejecuta un comando ó tarea. Luego que esta tarea/comando se ejecutó, se detendrá la ejecución del contenedor.
    Por tanto no podremos ejecutar otro comando, a menos que iniciemos el contenedor con el comando ~docker start~
    #+END_QUOTE

    #+name: docker-diferencias-comandos-run-exec
    #+BEGIN_QUOTE
    El comando ~docker run~ crea un contenedor que corra una tarea/comando 
    El comando ~docker exec~ ejecuta en un contenedor ya existente una tarea/comando

    Si queremos crear un contenedor que tenga una distribución de linux,
    y podamos mandarle via terminal a ese linux comandos (ls, ps, ...) 
    ó acceder al linux con una pseudoterminal (modo interactivo)
    
    debemos habilitar en el comando ~docker run~ el modo de "pseudoterminal" con el parámetro ~-t~ (hace referencia a tty)
    para que luego podamos acceder con ~docker exec~ a la pseudoterminal de forma interactiva con el parámetro ~-i -t~
    ó solo enviarle comandos (sin usar -i -t)
    
    Si usamos los parámetros ~-i -t~ en el comando ~docker run~,
    habilitará la terminal, ejecutará el comando que le pasemos y entrará en el contenedor de manera interactiva
    #+END_QUOTE

    #+name: docker-crear-contenedor-en-segundo-plano
    #+BEGIN_SRC shell
      # Creamos un contenedor con las siguientes características
      # -El puerto 8000 habilitado, y podamos acceder a ese puerto desde nuestro ordenador desde puerto 80 (se redirecciona)
      # -Con el nombre "miservidor"
      # -Que sea un linux con la distribución Debian booster
      # -Que podamos via terminal mandarles comandos (ls,ps,...), ó también acceder de manera interactiva
      # -Que se ejecute en segundo plano

      # Parámetros utilizados:
      # - t: Habilita la pseudoterminal, para enviar comandos o acceder de manera interactiva
      # - d: Corre el contenedor en segundo parámetro,
      # -- name: le asignamos un nombre para usar de referencia
      # - p puertoHost:puertoContenedor, abre un puerto para el contenedor
      #  (el segundo puerto es el que usa el contenedor, y el primero el que usaremos fuera de docker en nuestro ordenador)
      docker run --name miservidor -t -d -p 8000:80 debian:booster

      # ejecutamos un comando para listar los directorios de miservidor
      # sin necesidad de acceder al contenedor de manera interactiva (osea sin los parámetros -t -i)
      docker exec miservidor ls

      # accedemos al servidor de manera interactiva (parámetro -i) mediante una pseudoterminal (parámetro -t)
      # Observaciones:
      # - Según la distribución de linux, puede que en vez de escribir "bash" debas escribir "sh"
      # - Para salir del contenedor utilizar el comando "exit"
      docker exec -ti miservidor bash
    #+END_SRC
**** Referencias (de Issues)
     1. [[https://mkyong.com/docker/docker-exec-bash-executable-file-not-found-in-path/][Docker -exec: Executable file not found - mkyong.com/docker]]
     2. [[https://stackoverflow.com/questions/29599632/docker-container-is-not-running/45270860#45270860][Docker Container is not running - stackoverflow.com]]
*** Crear Imagenes
