dist/guia-virtualizacion/docker.html
<div id="outline-container-org00bf698" class="outline-4">
<h4 id="org00bf698"><span class="section-number-4">1.3.4.</span> Observaciones importantes</h4>
<div class="outline-text-4" id="text-1-3-4">
<ul class="org-ul">
<li>Si queremos acceder al container (NO CREAR UNO NUEVO) usamos <code>docker exec -it IDdeAlgunaImagen bash</code> (<i>si usamos run se creará un nuevo container</i>)</li>
<li>Siempre se crea un contenedor distinto cuando ejecutas una imagen con <code>docker run -it IdAlgunaImagen bash</code></li>
<li>Podemos usar el comando <code>docker run -it IDdeAlgunaImagen bash</code> para crear un nuevo contenedor</li>
<li>Si queremos guardar cambios de un container, podemos versionarlo comiteando y pusheando los cambios en algun repositorio</li>
</ul>

<pre class="example" id="org0799f33">Supongamos que tenemos un container de un ubuntu trusty (14.04) que ya tiene varios packages porque es el que usamos
(Ej. haskell, prolog, git, etc...) pero queremos probar un nuevo package o configuración
como sería instalar mysql, mongodb, etc.. sin que se vea afectado el que solemos usar.
Osea queremos uno de prueba, que sea idéntico al que usamos, donde instalemos cosas o probemos configuraciones del sistema operativo.

Entonces podemos correr el comando "docker run -it nombreImagen" para crear un nuevo container que tiene
lo mismo que al que apuntamos con el ID, si no funciona lo que queriamos instalar o no era
lo que necesitabamos borramos ese nuevo container y nos quedamos con el anterior

Observaciones:
Si estamos diciendo que esa imagen ya dispone de varios programas que nosotros instalamos,
es porque nosotros previamente hicimos un build de una imagen que disponga esos programas.
Para más información nos toca investigar sobre Dockerfile.
</pre>
</div>
</div>
<div id="outline-container-org593a018" class="outline-4">
<h4 id="org593a018"><span class="section-number-4">1.3.5.</span> Crear Contenedores en primer y segundo plano</h4>
<div class="outline-text-4" id="text-1-3-5">
</div>
<ol class="org-ol">
<li><a id="org8061233"></a>Conceptos<br>
<div class="outline-text-5" id="text-1-3-5-1">
<ul class="org-ul">
<li>Para crear contenedores que corran en segundo plano pasamos el parámetro <code>-d</code> al comando <code>docker run</code></li>
<li>Para ejecutar contenedores que corran en segundo plano pasamos el parámetro <code>-d</code> al comando <code>docker exec</code></li>
</ul>

<blockquote id="org8fcea7b">
<p>
Al crear un contenedor en segundo plano, se ejecutará de fondo (osea por detrás de la terminal)
de donde ejecutemos el comando <code>docker run</code>, pudiendo seguir utilizando esa terminal donde lo ejecutamos.
(particularmente útil para correr servidores linux, base de datos, ….)
</p>

<p>
Si no lo creamos en segundo plano, nos aparecerá en la terminal el resultado de ejecutar el contenedor.
Si el contenedor era un servidor linux ó una base de datos, el ciclo de ciclo de vida del contenedor finalizará
luego de ejecutar el sevidor o la base de datos.
Sería como encenderlo, y luego apagarlo, sin poder darle uso. Teniendo que iniciar el contenedor nuevamente.
</p>

<p>
Es decir si creamos un contenedor en primer plano (no le pasamos el parámetro -d)
que ejecuta un comando ó tarea. Luego que esta tarea/comando se ejecutó, se detendrá la ejecución del contenedor.
Por tanto no podremos ejecutar otro comando, a menos que iniciemos el contenedor con el comando <code>docker start</code>
</p>
</blockquote>

<blockquote id="orgbf316d8">
<p>
El comando <code>docker run</code> crea un contenedor que corra una tarea/comando 
El comando <code>docker exec</code> ejecuta en un contenedor ya existente una tarea/comando
</p>

<p>
Si queremos crear un contenedor que tenga una distribución de linux,
y podamos mandarle via terminal a ese linux comandos (ls, ps, …) 
ó acceder al linux con una pseudoterminal (modo interactivo)
</p>

<p>
debemos habilitar en el comando <code>docker run</code> el modo de "pseudoterminal" con el parámetro <code>-t</code> (hace referencia a tty)
para que luego podamos acceder con <code>docker exec</code> a la pseudoterminal de forma interactiva con el parámetro <code>-i -t</code>
ó solo enviarle comandos (sin usar -i -t)
</p>

<p>
Si usamos los parámetros <code>-i -t</code> en el comando <code>docker run</code>,
habilitará la terminal, ejecutará el comando que le pasemos y entrará en el contenedor de manera interactiva
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-shell" id="orgaccc639"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Creamos un contenedor con las siguientes características</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">-El puerto 8000 habilitado, y podamos acceder a ese puerto desde nuestro ordenador desde puerto 80 (se redirecciona)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">-Con el nombre "miservidor"</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">-Que sea un linux con la distribución Debian booster</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">-Que podamos via terminal mandarles comandos (ls,ps,...), ó también acceder de manera interactiva</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">-Que se ejecute en segundo plano</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Parámetros utilizados:</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- t: Habilita la pseudoterminal, para enviar comandos o acceder de manera interactiva</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- d: Corre el contenedor en segundo parámetro,</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">-- name: le asignamos un nombre para usar de referencia</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- p puertoHost:puertoContenedor, abre un puerto para el contenedor</span>
<span style="color: #2aa1ae; background-color: #292e34;">#  </span><span style="color: #2aa1ae; background-color: #292e34;">(el segundo puerto es el que usa el contenedor, y el primero el que usaremos fuera de docker en nuestro ordenador)</span>
docker run --name miservidor -t -d -p <span style="color: #a45bad;">8000:80</span> debian:booster

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">ejecutamos un comando para listar los directorios de miservidor</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">sin necesidad de acceder al contenedor de manera interactiva (osea sin los parámetros -t -i)</span>
docker exec miservidor ls

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">accedemos al servidor de manera interactiva (parámetro -i) mediante una pseudoterminal (parámetro -t)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Observaciones:</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- Según la distribución de linux, puede que en vez de escribir "bash" debas escribir "sh"</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- Para salir del contenedor utilizar el comando "exit"</span>
docker exec -ti miservidor bash
</pre>
</div>
</div>
</li>
<li><a id="org4c82347"></a>Referencias (de Issues)<br>
<div class="outline-text-5" id="text-1-3-5-2">
<ol class="org-ol">
<li><a href="https://mkyong.com/docker/docker-exec-bash-executable-file-not-found-in-path/">Docker -exec: Executable file not found - mkyong.com/docker</a></li>
<li><a href="https://stackoverflow.com/questions/29599632/docker-container-is-not-running/45270860#45270860">Docker Container is not running - stackoverflow.com</a></li>
</ol>
</div>
</li>
</ol>
</div>
