src/org-files/guia-virtualizacion/docker.org
**** Conceptos
      #+name: docker-crear-imagenes
      #+BEGIN_QUOTE
      Podemos crear una imagen de un servidor web que tenga por defecto algunos lenguajes de programación
      como haskell, php, etc.. Ó que también tenga servicios de base de datos como sql, mysql, mongodb, etc..
      y a partir de esas imagenes podemos crear contenedores.
    
      Tiene como ventaja no tener que configurar manualmente ni tampoco instalar todos los paquetes uno por uno,
      porque la imagen lo automatiza, y cada nuevo contenedor será idéntico.
    
      Además podemos crear contenedores para probar nuevos paquetes, que desconocemos si pueden generar alguna falla
      con el sistema operativo que tiene el contenedor.

      Por tanto si algo fallara, sólo tendriamos que borrar el contenedor y crear uno nuevo a partir de la imagen base
      de la que partimos para crear los contenedores.
      #+END_QUOTE

**** Referencias
     1. [[https://aulasoftwarelibre.github.io/taller-de-docker/dockerfile/][Crear imágenes propias - aulasoftwarelibre]]
*** Eliminar multiples Contenedores
**** Ejemplos
     #+name: docker-eliminar-contenedores
     #+BEGIN_SRC sh
       # listamos los contenedores en ejecución
       docker ps
       # otra manera de listar los contenedores en ejecución
       docker container ls

       # listamos TODOS los contenedores (también los inactivos)
       docker ps -a
       # otra manera de listar TODOS los contenedores
       docker container ls -a

       # para detener todos los contenedores
       # - el parámetro -aq genera y devuelve un listado de contenedores
       docker container stop $(docker container ls -aq)

       # eliminamos uno o varios contenedores por id
       # (El id lo podemos conocer cuando listamos los contenedores, es la primera columna)
       docker container rm idDeUnContenedor idOtroContenedor

       # eliminamos todos los contenedores inactivos
       docker container prune

       # eliminamos contenedores por uno o varios criterios
       # - borrar los que fueron creados hace mas de 12 horas
       docker container prune --filter "until=12h"
     #+END_SRC
**** Referencias Web - Extraoficiales
    1. [[https://phoenixnap.com/kb/remove-docker-images-containers-networks-volumes][Remove Docker images containers networks volumes - phoenix.com]]
*** Eliminar multiples imagenes
    Recordemos que para eliminar contenedores usamos el comando *rm*
    mientras que para remover imagenes es *rmi*

     #+name: docker-eliminar-imagenes
     #+BEGIN_SRC sh
      # listamos las imagenes para revisar el ID
      docker images ls
      # suponiendo que son varias imagenes se pueden agrupar en una linea
      docker rmi a23bb4013216 a341b4013200 a24bb422226
     #+END_SRC 
*** Descargar ó Actualizar un Contenedor
    #+name: docker-descargar-actualizar-contenedor
    #+BEGIN_SRC sh
      # para descargar una imagen ó actualizar un container local ya existente
      # el uso de tag es opcional
      docker pull nombreAlgunContainer:tag

      # usamos los tags para descargar ó actualizar a una versión específica
      # sino especificamos, nos suele traer por defecto la última vesión (latest)

      # usamos de tag el número de la versión
      docker pull ubuntu:14.04 # es la distribución trusty de ubuntu
      docker pull debian:10 # es la distribución buster de debian

      # usamos de tag el nombre de la versión
      docker pull ubuntu:trusty # 14.x
      docker pull debian:buster # 10.x
    #+END_SRC
*** Listar contenedores en ejecución e inactivos
    #+name: docker-listar-contenedores 
     #+BEGIN_SRC sh
      # listar containers en ejecución
      docker ps
      # -l se refiere a "list"
      docker ps -l # tiene el mismo resultado que no pasarle el parámetro -l

      # lista todos los containers (los inactivos también)
      # -a se refiere a "all"
      docker ps -a
     #+END_SRC
*** Acceder ó Iniciar/Detener ejecución de contenedores
