dist/guia-virtualizacion/docker.html
<div id="outline-container-orgddd7d42" class="outline-4">
<h4 id="orgddd7d42"><span class="section-number-4">1.3.6.</span> Crear Imagenes</h4>
<div class="outline-text-4" id="text-1-3-6">
</div>
<ol class="org-ol">
<li><a id="org326408e"></a>Conceptos<br>
<div class="outline-text-5" id="text-1-3-6-1">
<blockquote id="org6c2b75a">
<p>
Podemos crear una imagen de un servidor web que tenga por defecto algunos lenguajes de programación
como haskell, php, etc.. Ó que también tenga servicios de base de datos como sql, mysql, mongodb, etc..
y a partir de esas imagenes podemos crear contenedores.
</p>

<p>
Tiene como ventaja no tener que configurar manualmente ni tampoco instalar todos los paquetes uno por uno,
porque la imagen lo automatiza, y cada nuevo contenedor será idéntico.
</p>

<p>
Además podemos crear contenedores para probar nuevos paquetes, que desconocemos si pueden generar alguna falla
con el sistema operativo que tiene el contenedor.
</p>

<p>
Por tanto si algo fallara, sólo tendriamos que borrar el contenedor y crear uno nuevo a partir de la imagen base
de la que partimos para crear los contenedores.
</p>
</blockquote>
</div>
</li>

<li><a id="org75c2771"></a>Referencias<br>
<div class="outline-text-5" id="text-1-3-6-2">
<ol class="org-ol">
<li><a href="https://aulasoftwarelibre.github.io/taller-de-docker/dockerfile/">Crear imágenes propias - aulasoftwarelibre</a></li>
</ol>
</div>
</li>
</ol>
</div>
<div id="outline-container-org0b9b088" class="outline-4">
<h4 id="org0b9b088"><span class="section-number-4">1.3.7.</span> Eliminar multiples Contenedores</h4>
<div class="outline-text-4" id="text-1-3-7">
</div>
<ol class="org-ol">
<li><a id="org5c971aa"></a>Ejemplos<br>
<div class="outline-text-5" id="text-1-3-7-1">
<div class="org-src-container">
<pre class="src src-sh" id="orgb080f4f"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">listamos los contenedores en ejecución</span>
docker ps
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">otra manera de listar los contenedores en ejecución</span>
docker container ls

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">listamos TODOS los contenedores (también los inactivos)</span>
docker ps -a
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">otra manera de listar TODOS los contenedores</span>
docker container ls -a

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">para detener todos los contenedores</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- el parámetro -aq genera y devuelve un listado de contenedores</span>
docker container stop $<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">docker</span> container ls -aq<span style="color: #4f97d7;">)</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">eliminamos uno o varios contenedores por id</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">(El id lo podemos conocer cuando listamos los contenedores, es la primera columna)</span>
docker container rm idDeUnContenedor idOtroContenedor

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">eliminamos todos los contenedores inactivos</span>
docker container prune

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">eliminamos contenedores por uno o varios criterios</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- borrar los que fueron creados hace mas de 12 horas</span>
docker container prune --filter <span style="color: #2d9574;">"until=12h"</span>
</pre>
</div>
</div>
</li>
<li><a id="org0eec170"></a>Referencias Web - Extraoficiales<br>
<div class="outline-text-5" id="text-1-3-7-2">
<ol class="org-ol">
<li><a href="https://phoenixnap.com/kb/remove-docker-images-containers-networks-volumes">Remove Docker images containers networks volumes - phoenix.com</a></li>
</ol>
</div>
</li>
</ol>
</div>
<div id="outline-container-org4da6f51" class="outline-4">
<h4 id="org4da6f51"><span class="section-number-4">1.3.8.</span> Eliminar multiples imagenes</h4>
<div class="outline-text-4" id="text-1-3-8">
<p>
Recordemos que para eliminar contenedores usamos el comando <b>rm</b>
mientras que para remover imagenes es <b>rmi</b>
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org51dab9f"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">listamos las imagenes para revisar el ID</span>
docker images ls
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">suponiendo que son varias imagenes se pueden agrupar en una linea</span>
docker rmi a23bb4013216 a341b4013200 a24bb422226
</pre>
</div>
</div>
</div>
<div id="outline-container-orgee42985" class="outline-4">
<h4 id="orgee42985"><span class="section-number-4">1.3.9.</span> Descargar ó Actualizar un Contenedor</h4>
<div class="outline-text-4" id="text-1-3-9">
<div class="org-src-container">
<pre class="src src-sh" id="orgd895dc3"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">para descargar una imagen ó actualizar un container local ya existente</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">el uso de tag es opcional</span>
docker pull nombreAlgunContainer:tag

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">usamos los tags para descargar ó actualizar a una versión específica</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">sino especificamos, nos suele traer por defecto la última vesión (latest)</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">usamos de tag el número de la versión</span>
docker pull ubuntu:14.04 <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">es la distribución trusty de ubuntu</span>
docker pull debian:10 <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">es la distribución buster de debian</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">usamos de tag el nombre de la versión</span>
docker pull ubuntu:trusty <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">14.x</span>
docker pull debian:buster <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">10.x</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1e2d584" class="outline-4">
<h4 id="org1e2d584"><span class="section-number-4">1.3.10.</span> Listar contenedores en ejecución e inactivos</h4>
<div class="outline-text-4" id="text-1-3-10">
<div class="org-src-container">
<pre class="src src-sh" id="orgdcc054a"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">listar containers en ejecución</span>
docker ps
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">-l se refiere a "list"</span>
docker ps -l <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">tiene el mismo resultado que no pasarle el parámetro -l</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">lista todos los containers (los inactivos también)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">-a se refiere a "all"</span>
docker ps -a
</pre>
</div>
</div>
</div>
<div id="outline-container-org0f60065" class="outline-4">
<h4 id="org0f60065"><span class="section-number-4">1.3.11.</span> Acceder ó Iniciar/Detener ejecución de contenedores</h4>
<div class="outline-text-4" id="text-1-3-11">
</div>
<ol class="org-ol">
