src/org-files/guia-virtualizacion/docker.org
**** Conceptos
     - Iniciamos el contenedor ejecutando en la terminal ~docker start~
     - Detenemos la ejecución con ~docker stop~
    
     #+name: docker-ejemplo1-iniciar-contenedor
     #+BEGIN_EXAMPLE
     Si al crear el contenedor mediante *docker run*
     no le pasamos el parámetro -it, entonces no podremos acceder por terminal
     mediante este otro comando *docker exec -it IDdeAlgunContenedor bash*

     Porque el comando *run* como dice su nombre, ejecuta un comando cuando se inicie el contenedor
     si no le decimos que lo haga con el modo interactivo mediante una pseudoterminal (parámetros -i y -t)
     tampoco lo hará cuando se lo pasemos al comando *exec*
     #+END_EXAMPLE
   
     #+name: docker-ejemplo2-iniciar-contenedor
     #+BEGIN_EXAMPLE
     Usando de referencia el ejemplo1, una vez que salgamos del modo interactivo con la pseudoterminal
     el contenedor se detendrá, y deberemos de iniciarlo nuevamente. 

     Si no queremos estar iniciando a cada rato el contenedor
     podemos adicionar el parámetro -d para ejecutarlo en un segundo plano
    
     Observación:
     Tenenemos un apartado que detalle un poco más sobre el parámetro d,
     esto es solo a modo de aclaración, de que se detendrá el contenedor una vez que salgamos del modo interactivo.
     #+END_EXAMPLE
    
     #+name: docker-iniciar-detener-contenedor
     #+BEGIN_SRC sh
       # iniciar un container
       # se le puede pasar el nombre, o el ID
       # docker start nombreContainer
       # docker start idContainer
       docker start miUbuntu

       # detener un container en ejecución
       # docker stop nombreContainer
       # docker stop idContainer
       docker stop miDebian

       # entrar al modo interactivo via terminal
       # docker exec -it nombreContainer
       # docker exec -it idContainer
       docker exec -it alpine sh

       # Según la distribución de Linux puede que la ruta /bin/bash no aparezca
       # docker exec -it algunContainer sh
       # docker exec -it algunContainer /bin/bash
       docker exec -it ubuntu bin/bash
     #+END_SRC
*** Versionar containers
**** Conceptos
     Suponiendo que ya habiamos creado en la página de *dockerhub* un repositorio llamado *distroalpine*
     podemos realizar los ejemplos de crear tag, o subir los cambios.
**** Crear un tag a nuestro container local
     #+name: docker-crear-tag
     #+BEGIN_SRC sh
       docker tag a24bb4013296 neverkas/distroalpine:3.12

       # los datos que aparecen son
       # - usuario (dueño) del repositorio: neverkas
       # - nombre del repositorio: distroalpine
       # - tag (version en este caso): 3.12
     #+END_SRC
**** Subir los cambios
     #+name: docker-push 
     #+BEGIN_SRC sh
       docker push neverkas/distroalpine:3.12

       # los datos que aparecen son
       # - usuario (dueño) del repositorio: neverkas
       # - nombre del repositorio: distroalpine
       # - tag (version en este caso): 3.12

     docker tag local-image:tagname new-repo:tagname
     docker push new-repo:tagname
     #+END_SRC
*** Abrir Puertos
    Usamos el parámetro ~-p~
*** Referencias Web Extraoficiales
    1. [[https://es.linux-console.net/?p=1181][Contenedor en segundo plano - linux-console.com]]
** Estados
   Los estados que puede tener un contenedor son dos *exited* (inactivo) ó *up* (en ejecución)

   #+NAME: docker-contenedor-estados
   |--------+--------------|
   | Estado | Descripcion  |
   |--------+--------------|
   | exited | Inactivo     |
   | up     | En ejecución |
   |--------+--------------|
** Configurando Puertos
** Configurando Volumenes
*** Conceptos
    Los *volumenes* por defecto se crean en la ruta /var/lib/docker/volumes
*** Ejemplos
    #+BEGIN_SRC sh
      # creamos un nuevo volumen
      # /datos es una ruta nuestro ordenador
      # /www es una ruta que está dentro del contenedor
      docker run -it -v /datos:/www/ --name mi-server alpine:latest sh
    #+END_SRC
*** Referencias Youtube
    1. [[https://www.youtube.com/watch?v=GfL_Ltu-eyw][Referencia #1]]
** Probando Distribuciones Linux
