dist/guia-virtualizacion/docker.html
<li><a id="orgd423654"></a>Conceptos<br>
<div class="outline-text-5" id="text-1-3-11-1">
<ul class="org-ul">
<li>Iniciamos el contenedor ejecutando en la terminal <code>docker start</code></li>
<li>Detenemos la ejecución con <code>docker stop</code></li>
</ul>

<pre class="example" id="orge8224c1">Si al crear el contenedor mediante *docker run*
no le pasamos el parámetro -it, entonces no podremos acceder por terminal
mediante este otro comando *docker exec -it IDdeAlgunContenedor bash*

Porque el comando *run* como dice su nombre, ejecuta un comando cuando se inicie el contenedor
si no le decimos que lo haga con el modo interactivo mediante una pseudoterminal (parámetros -i y -t)
tampoco lo hará cuando se lo pasemos al comando *exec*
</pre>

<pre class="example" id="org0e1c25d">Usando de referencia el ejemplo1, una vez que salgamos del modo interactivo con la pseudoterminal
el contenedor se detendrá, y deberemos de iniciarlo nuevamente. 

Si no queremos estar iniciando a cada rato el contenedor
podemos adicionar el parámetro -d para ejecutarlo en un segundo plano

Observación:
Tenenemos un apartado que detalle un poco más sobre el parámetro d,
esto es solo a modo de aclaración, de que se detendrá el contenedor una vez que salgamos del modo interactivo.
</pre>

<div class="org-src-container">
<pre class="src src-sh" id="orgbbdc6fb"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">iniciar un container</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">se le puede pasar el nombre, o el ID</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">docker start nombreContainer</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">docker start idContainer</span>
docker start miUbuntu

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">detener un container en ejecución</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">docker stop nombreContainer</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">docker stop idContainer</span>
docker stop miDebian

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">entrar al modo interactivo via terminal</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">docker exec -it nombreContainer</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">docker exec -it idContainer</span>
docker exec -it alpine sh

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Según la distribución de Linux puede que la ruta /bin/bash no aparezca</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">docker exec -it algunContainer sh</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">docker exec -it algunContainer /bin/bash</span>
docker exec -it ubuntu bin/bash
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org4be0f0c" class="outline-4">
<h4 id="org4be0f0c"><span class="section-number-4">1.3.12.</span> Versionar containers</h4>
<div class="outline-text-4" id="text-1-3-12">
</div>
<ol class="org-ol">
<li><a id="orgdfec194"></a>Conceptos<br>
<div class="outline-text-5" id="text-1-3-12-1">
<p>
Suponiendo que ya habiamos creado en la página de <b>dockerhub</b> un repositorio llamado <b>distroalpine</b>
podemos realizar los ejemplos de crear tag, o subir los cambios.
</p>
</div>
</li>
<li><a id="orgdca4cad"></a>Crear un tag a nuestro container local<br>
<div class="outline-text-5" id="text-1-3-12-2">
<div class="org-src-container">
<pre class="src src-sh" id="org1c485db">docker tag a24bb4013296 neverkas/distroalpine:3.12

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">los datos que aparecen son</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- usuario (dueño) del repositorio: neverkas</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- nombre del repositorio: distroalpine</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- tag (version en este caso): 3.12</span>
</pre>
</div>
</div>
</li>
<li><a id="orgeb38244"></a>Subir los cambios<br>
<div class="outline-text-5" id="text-1-3-12-3">
<div class="org-src-container">
<pre class="src src-sh" id="orgbb78ff5">  docker push neverkas/distroalpine:3.12

  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">los datos que aparecen son</span>
  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- usuario (dueño) del repositorio: neverkas</span>
  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- nombre del repositorio: distroalpine</span>
  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- tag (version en este caso): 3.12</span>

docker tag local-image:tagname new-repo:tagname
docker push new-repo:tagname
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org8017249" class="outline-4">
<h4 id="org8017249"><span class="section-number-4">1.3.13.</span> Abrir Puertos</h4>
<div class="outline-text-4" id="text-1-3-13">
<p>
Usamos el parámetro <code>-p</code>
</p>
</div>
</div>
<div id="outline-container-org69166b6" class="outline-4">
<h4 id="org69166b6"><span class="section-number-4">1.3.14.</span> Referencias Web Extraoficiales</h4>
<div class="outline-text-4" id="text-1-3-14">
<ol class="org-ol">
<li><a href="https://es.linux-console.net/?p=1181">Contenedor en segundo plano - linux-console.com</a></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org371086b" class="outline-3">
<h3 id="org371086b"><span class="section-number-3">1.4.</span> Estados</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Los estados que puede tener un contenedor son dos <b>exited</b> (inactivo) ó <b>up</b> (en ejecución)
</p>

<table id="orgdd10d0d" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="org-left">

<col class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Estado</th>
<th scope="col" class="org-left">Descripcion</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">exited</td>
<td class="org-left">Inactivo</td>
</tr>

<tr>
<td class="org-left">up</td>
<td class="org-left">En ejecución</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org1ef6190" class="outline-3">
<h3 id="org1ef6190"><span class="section-number-3">1.5.</span> Configurando Puertos</h3>
</div>
<div id="outline-container-orgcc4c4d9" class="outline-3">
<h3 id="orgcc4c4d9"><span class="section-number-3">1.6.</span> Configurando Volumenes</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-orgb3ff470" class="outline-4">
<h4 id="orgb3ff470"><span class="section-number-4">1.6.1.</span> Conceptos</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
Los <b>volumenes</b> por defecto se crean en la ruta /var/lib/docker/volumes
</p>
</div>
</div>
<div id="outline-container-orged0fd80" class="outline-4">
<h4 id="orged0fd80"><span class="section-number-4">1.6.2.</span> Ejemplos</h4>
<div class="outline-text-4" id="text-1-6-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">creamos un nuevo volumen</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">/datos es una ruta nuestro ordenador</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">/www es una ruta que está dentro del contenedor</span>
docker run -it -v /datos:/www/ --name mi-server alpine:latest sh
</pre>
</div>
</div>
</div>
<div id="outline-container-org6ef4c8f" class="outline-4">
<h4 id="org6ef4c8f"><span class="section-number-4">1.6.3.</span> Referencias Youtube</h4>
<div class="outline-text-4" id="text-1-6-3">
<ol class="org-ol">
<li><a href="https://www.youtube.com/watch?v=GfL_Ltu-eyw">Referencia #1</a></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org8a8db60" class="outline-3">
<h3 id="org8a8db60"><span class="section-number-3">1.7.</span> Probando Distribuciones Linux</h3>
<div class="outline-text-3" id="text-1-7">
</div>
