src/org-files/guia-virtualizacion/docker.org
*** Probando Alpine Edge
    #+BEGIN_SRC sh
       # https://www.emacswiki.org/emacs/Evil
       # https://orgmode.org/manual/Installation.html

       # corremos el container la version Edge (el tag)
       # si no existe lo descarga
       docker run alpine:edge
       # instalar git
       apk add git
       # instalar emacs
       apk add emacs
       # 1. listar packages (entrar al emacs)
       # M-x packages-list
       # 2. instalar org mode (entrar a emacs )
       # M-x package-install RET org RET
       # 3. instalar evil mode (tratè con el list-packages pero no aparecìa)
       git clone https://github.com/emacs-evil/evil.git
       mv evil ~/emacs.d/

       # descargar el theme dark dracula
       https://github.com/dracula/emacs.git
       mv /emacs/dracula-theme.el ~/emacs.d/themes/dracula-theme.el
    #+END_SRC

    Agregar lo sig al ~/.emacs para activar el vim mod y el theme dark dracula
    #+BEGIN_SRC emacs-lisp
      ; con esto agregamos el modo vim
      (add-to-list 'load-path "~/.emacs.d/evil")
      (require 'evil)
      (evil-mode 1)

      ; cargamos el theme dracula dark
      (add-to-list 'custom-theme-load-path "~/.emacs.d/themes")
      (load-theme 'dracula t)
    #+END_SRC
*** Probando Debian Buster
     #+BEGIN_SRC sh
       # 1. Descargamos el OS Debian
       # - Si ya lo teniamos lo actualizará
       # - Seguido de los dos puntos se puede escribir o no una etiqueta/tag
       # para especificar una distribución ó versión ó característica
       docker run debian:buster

       # 2. Accedemos al container
       # - el parámetro "i" hace referencia a "Modo Interactivo"
       # - el parámetro "t" hace referencia a "tty" una pseudo-terminal
       # osea interactuar de forma directa con el SO, via terminal y ejecutar instrucciones
       docker run -it debian:buster /bin/bash
     #+END_SRC
