dist/guia-virtualizacion/docker.html
<div id="outline-container-orgbbc5884" class="outline-4">
<h4 id="orgbbc5884"><span class="section-number-4">1.7.1.</span> Probando Alpine Edge</h4>
<div class="outline-text-4" id="text-1-7-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">https://www.emacswiki.org/emacs/Evil</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">https://orgmode.org/manual/Installation.html</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">corremos el container la version Edge (el tag)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">si no existe lo descarga</span>
docker run alpine:edge
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">instalar git</span>
apk add git
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">instalar emacs</span>
apk add emacs
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">1. listar packages (entrar al emacs)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">M-x packages-list</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">2. instalar org mode (entrar a emacs )</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">M-x package-install RET org RET</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">3. instalar evil mode (tratè con el list-packages pero no aparecìa)</span>
git clone https://github.com/emacs-evil/evil.git
mv evil ~/emacs.d/

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">descargar el theme dark dracula</span>
https://github.com/dracula/emacs.git
mv /emacs/dracula-theme.el ~/emacs.d/themes/dracula-theme.el
</pre>
</div>

<p>
Agregar lo sig al ~/.emacs para activar el vim mod y el theme dark dracula
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa1ae; background-color: #292e34;">; </span><span style="color: #2aa1ae; background-color: #292e34;">con esto agregamos el modo vim</span>
<span style="color: #4f97d7;">(</span>add-to-list 'load-path <span style="color: #2d9574;">"~/.emacs.d/evil"</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">require</span> '<span style="color: #a45bad;">evil</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>evil-mode <span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>

<span style="color: #2aa1ae; background-color: #292e34;">; </span><span style="color: #2aa1ae; background-color: #292e34;">cargamos el theme dracula dark</span>
<span style="color: #4f97d7;">(</span>add-to-list 'custom-theme-load-path <span style="color: #2d9574;">"~/.emacs.d/themes"</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>load-theme 'dracula t<span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0de71cb" class="outline-4">
<h4 id="org0de71cb"><span class="section-number-4">1.7.2.</span> Probando Debian Buster</h4>
<div class="outline-text-4" id="text-1-7-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">1. Descargamos el OS Debian</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- Si ya lo teniamos lo actualizará</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- Seguido de los dos puntos se puede escribir o no una etiqueta/tag</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">para especificar una distribución ó versión ó característica</span>
docker run debian:buster

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">2. Accedemos al container</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- el parámetro "i" hace referencia a "Modo Interactivo"</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- el parámetro "t" hace referencia a "tty" una pseudo-terminal</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">osea interactuar de forma directa con el SO, via terminal y ejecutar instrucciones</span>
docker run -it debian:buster /bin/bash
</pre>
</div>
</div>
</div>
