src/org-files/guia-virtualizacion/docker.org
*** Probando Ubuntu Trusty
    #+BEGIN_SRC sh
      # entramos a la terminal (se creará un nuevo contenedor "distinto" cada vez que ejecutamos este comando)
      # docker run -it ubuntu:trusty bin/bash

      # descargamos la distribución ubuntu versión trusty (14.04)
      docker pull ubuntu:trusty

      # creamos una carpeta en nuestro HOST y la compartimos
      mkdir ~/Docker
      # Hacemos un punto de montaje
      # 1.Para asignar el nombre al contenedor usamos --name
      # 2.Para referirnos al volumen usamos -v
      # 3.La ruta (debe ser absoluta agregando ~) del HOST a compartir será ~/Docker
      #   (si no es absoluta, se creará un volumen que se comparte entre los demás containers, a docker volume)
      # 4.La nueva ruta que se creará en el Container /opt/share
      # 5.La imagen a utilizar es ubuntu:trusty
      # 6.En la bash shell
      # docker run -v ~/Docker:/opt/share -it ubuntu:trusty /bin/bash
      docker run -it --name test1 -v ~/Docker:/opt/share ubuntu:trusty bash

      # IMPORTANTE:
      # Recorda que cada vez que ejecutes "run" se creará un nuevo contenedor
      # en este caso se montará un punto de montaje entre Host/Un nuevo Contenedor llamado "test1"
      # cada vez que quieras hacer cambios en ese "contenedor"
      # acceder con docker exec -it test /bin/bash

      # comprobamos
      docker ps -a | grep test1
      # iniciamos el proceso del container
      docker start test1
      # corremos el comando "modo interactivo" en el container "test1" y accedemos a la bash shell
      # (si usamos run, se creará un nuevo contenedor, la idea es utilizar este y no se creará otro)
      docker exec -it test1 /bin/bash

      apt-get update
      apt-get install swi-prolog -y

      # versionamos para guardar el estado del container
      docker ps -a # para revisar el id del container
      docker commit 5b13ee15d1f1 neverkas/ubuntu-trusty # suponiendo que ese es el ID
      docker push neverkas/ubuntu-trusty

      # revisamos el nuevo contenedor
      docker ps -a

      # salimos del contenedor
      exit
      # si queremos revisar la version de prolog instalada sin entrar al container
      docker exec test1 swipl -v
      # si queremos acceder al container y ejecutar prolog
      docker exec -it test1 swipl
      exit # salimos
      # si queremos acceder solo como en la bash shell
      docker exec -it test1 /bin/bash

      # IMPORTANTE:
      # - Al hacer commit se creará una nueva imagen, que apunta al repositorio publico "neverkas/ubuntu-trusty"
      # el usuario seria neverkas (LA PRIMERA VEZ, LAS PROXIMAS APUNTARAN SIEMPRE AL MISMO CONTAINER)
      # seguido del nombre de container que se guardará como local (sería una imagen)
    #+END_SRC
*** Ubuntu
    Cada versión de la distribución lleva un nombre distinto

    #+NAME: ubuntu-versiones
    |---------+--------|
    | Version | Nombre |
    |---------+--------|
    |   14.04 | Trusty |
    |   16.04 | Xenial |
    |   18.04 | Bionic |
    |---------+--------|

    *Referencias*
    + [[https://releases.ubuntu.com/][Ubuntu releases - ubuntu.com]]
    + [[https://hub.docker.com/_/ubuntu?tab=tags][Ubuntu Tags - hub.docker.com]]
    + [[https://wwu-pi.github.io/tutorials/lectures/lsp/010_install_swi_prolog.html][Installing SWI-Prolog - pi-github.io]]
** Configurando Redes Docker
*** Conceptos
*** Crear Red
    #+BEGIN_SRC sh
      docker network create mi-red
      # crea una red con un rango 
      docker network create --subnet=192.168.0.0/16 mi-red2

      nmcli con
      ip a | more
      docker inspect mi-red > mi-red.txt
    #+END_SRC
*** Referencias
