dist/guia-virtualizacion/docker.html
<div id="outline-container-org7f20519" class="outline-4">
<h4 id="org7f20519"><span class="section-number-4">1.7.3.</span> Probando Ubuntu Trusty</h4>
<div class="outline-text-4" id="text-1-7-3">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">entramos a la terminal (se creará un nuevo contenedor "distinto" cada vez que ejecutamos este comando)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">docker run -it ubuntu:trusty bin/bash</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">descargamos la distribución ubuntu versión trusty (14.04)</span>
docker pull ubuntu:trusty

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">creamos una carpeta en nuestro HOST y la compartimos</span>
mkdir ~/Docker
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Hacemos un punto de montaje</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">1.Para asignar el nombre al contenedor usamos --name</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">2.Para referirnos al volumen usamos -v</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">3.La ruta (debe ser absoluta agregando ~) del HOST a compartir será ~/Docker</span>
<span style="color: #2aa1ae; background-color: #292e34;">#   </span><span style="color: #2aa1ae; background-color: #292e34;">(si no es absoluta, se creará un volumen que se comparte entre los demás containers, a docker volume)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">4.La nueva ruta que se creará en el Container /opt/share</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">5.La imagen a utilizar es ubuntu:trusty</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">6.En la bash shell</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">docker run -v ~/Docker:/opt/share -it ubuntu:trusty /bin/bash</span>
docker run -it --name test1 -v ~/Docker:/opt/share ubuntu:trusty bash

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">IMPORTANTE:</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Recorda que cada vez que ejecutes "run" se creará un nuevo contenedor</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">en este caso se montará un punto de montaje entre Host/Un nuevo Contenedor llamado "test1"</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">cada vez que quieras hacer cambios en ese "contenedor"</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">acceder con docker exec -it test /bin/bash</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">comprobamos</span>
docker ps -a | grep test1
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">iniciamos el proceso del container</span>
docker start test1
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">corremos el comando "modo interactivo" en el container "test1" y accedemos a la bash shell</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">(si usamos run, se creará un nuevo contenedor, la idea es utilizar este y no se creará otro)</span>
docker exec -it test1 /bin/bash

apt-get update
apt-get install swi-prolog -y

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">versionamos para guardar el estado del container</span>
docker ps -a <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">para revisar el id del container</span>
docker commit <span style="color: #a45bad;">5b13ee15d1f1</span> neverkas/ubuntu-trusty <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">suponiendo que ese es el ID</span>
docker push neverkas/ubuntu-trusty

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">revisamos el nuevo contenedor</span>
docker ps -a

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">salimos del contenedor</span>
<span style="color: #4f97d7; font-weight: bold;">exit</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">si queremos revisar la version de prolog instalada sin entrar al container</span>
docker exec test1 swipl -v
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">si queremos acceder al container y ejecutar prolog</span>
docker exec -it test1 swipl
<span style="color: #4f97d7; font-weight: bold;">exit</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">salimos</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">si queremos acceder solo como en la bash shell</span>
docker exec -it test1 /bin/bash

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">IMPORTANTE:</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- Al hacer commit se creará una nueva imagen, que apunta al repositorio publico "neverkas/ubuntu-trusty"</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">el usuario seria neverkas (LA PRIMERA VEZ, LAS PROXIMAS APUNTARAN SIEMPRE AL MISMO CONTAINER)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">seguido del nombre de container que se guardará como local (sería una imagen)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9f291ff" class="outline-4">
<h4 id="org9f291ff"><span class="section-number-4">1.7.4.</span> Ubuntu</h4>
<div class="outline-text-4" id="text-1-7-4">
<p>
Cada versión de la distribución lleva un nombre distinto
</p>

<table id="org3e8f154" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="org-right">

<col class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Version</th>
<th scope="col" class="org-left">Nombre</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">14.04</td>
<td class="org-left">Trusty</td>
</tr>

<tr>
<td class="org-right">16.04</td>
<td class="org-left">Xenial</td>
</tr>

<tr>
<td class="org-right">18.04</td>
<td class="org-left">Bionic</td>
</tr>
</tbody>
</table>

<p>
<b>Referencias</b>
</p>
<ul class="org-ul">
<li><a href="https://releases.ubuntu.com/">Ubuntu releases - ubuntu.com</a></li>
<li><a href="https://hub.docker.com/_/ubuntu?tab=tags">Ubuntu Tags - hub.docker.com</a></li>
<li><a href="https://wwu-pi.github.io/tutorials/lectures/lsp/010_install_swi_prolog.html">Installing SWI-Prolog - pi-github.io</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9b432a8" class="outline-3">
<h3 id="org9b432a8"><span class="section-number-3">1.8.</span> Configurando Redes Docker</h3>
<div class="outline-text-3" id="text-1-8">
</div>
<div id="outline-container-orgef7b8e2" class="outline-4">
<h4 id="orgef7b8e2"><span class="section-number-4">1.8.1.</span> Conceptos</h4>
</div>
<div id="outline-container-orgef4af8a" class="outline-4">
<h4 id="orgef4af8a"><span class="section-number-4">1.8.2.</span> Crear Red</h4>
<div class="outline-text-4" id="text-1-8-2">
<div class="org-src-container">
<pre class="src src-sh">docker network create mi-red
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">crea una red con un rango </span>
docker network create --subnet=<span style="color: #a45bad;">192.168.0.0/16</span> mi-red2

nmcli con
ip a | more
docker inspect mi-red &gt; mi-red.txt
</pre>
</div>
</div>
</div>
