src/org-files/guia-virtualizacion/docker.org
** Ejemplos
   #+BEGIN_SRC sh
     # Creamos una red para conectar el contenedor
     docker network create --driver=bridge red-jelou

     # creamos el contenedor llamado prueba1 que tenga linux alpine edge
     # montamos un volumen llamado datos-jelou que usará
     # le asignamos la red que creamos previamente
     # y que ejecute el comando "sh" al iniciar (caso contrario no podemos acceder)
     docker run --name=prueba1 -it -v datos-jelou:/opt --network=red-jelou alpine:edge sh

     # analizamos el punto de montaje, osea donde se creó el volumen en el Host
     # - el volumen se puede compartir entre otros contenedores
     docker volume inspect datos-jelou

     # analizamos la red,
     # que otros contenedores la utilizan
     docker network red-jelou

   #+END_SRC
  
   Una breve explicación de los comandos ejecutados
   #+BEGIN_QUOTE
   run
   #   crea un contenedor

   -it
   # habilita una pseudo terminal para acceder al contenedor

   -v jelou:/opt
   #   Monta un volumen que apunta a la ruta /opt del contenedor
   #   si ya existe solo le asigna ese volumen al contenedor
   #   Se puede compartir el volumen entre otros contenedores

   --network=red-jelou
   #   Utiliza una red llamada red-jelou (previamente hay que crearla)

   alpine:edge
   #   Elegimos la distribución Alpine de Linux
   #   y especificamos que sea la versión "Edge"
   #+END_QUOTE
** Referencias
*** Referencias Web Extraoficiales
    1. [[https://docs.docker.com/develop/develop-images/dockerfile_best-practices/][Best practices for writing Dockerfiles - docs.docker.com]]
    2. https://docs.docker.com/engine/reference/commandline/container_prune/
    3. [[https://github.com/rocker-org/rocker/wiki/How-to-save-data][How to save data - github.com/rocker-org]]
    4. [[https://www.digitalocean.com/community/tutorials/como-instalar-y-usar-docker-en-ubuntu-18-04-1-es][Como instalar y usar Docker en Ubuntu 18.04 - Digitalocean.com]]
    5. [[https://www.ionos.es/digitalguide/servidores/configuracion/tutorial-docker-instalacion-y-primeros-pasos/][Tutorial Docker - Instalación y primeros pasos - Ionos.es]]
    6. [[https://colorfield.be/blog/cleaning-lando-containers][Cleaning up containers - colorfield.de]]
    7. [[https://blog.hipolabs.com/understanding-docker-without-losing-your-shit-cf2b30307c63][Understanding Docker - Blog hipolabs]]
    8. [[https://docs.docker.com/engine/reference/commandline/commit/][Docker commit - Docker.com]]
*** Referencias Issues
    1. [[https://stackoverflow.com/questions/21871479/docker-cant-connect-to-docker-daemon][Docker Can't connect to docker daemon - Stackoverflow.com]]
    2. [[https://www.digitalocean.com/community/questions/how-to-fix-docker-got-permission-denied-while-trying-to-connect-to-the-docker-daemon-socket][Permission denied while trying to connect to Docker Daemon - Digitalocean.com]]
*** Referencias Youtube
    1. [[https://www.youtube.com/watch?v=r6bxsuDq6wY&list=PLmBbXLdrZ-O3B3rsLOVHufTL_wmickgLf&ab_channel=ServersforHackers][Playlist #1]]
    2. [[https://www.youtube.com/watch?v=jjuIEHhXX7k&list=PLmBbXLdrZ-O0GxzRkPdY6zUe9XRYNt38A&ab_channel=ServersforHackers][Playlist #2]]
    3. [[https://www.youtube.com/watch?v=PbiYll21Jxg&list=PLZdsdjcJ44WU_cY2Y1LFLnmsSjFD5BZLZ][Playlist - Docker container course (el mejor por ahora)]]
    4. [[https://www.youtube.com/watch?v=vjnOIE-CwMU&list=PLqRCtm0kbeHAep1hc7yW-EZQoAJqSTgD-&index=2][Video - Docker - primeros pasos]]
    5. [[https://www.youtube.com/watch?v=6idFknRIOp4&t=201s][Video - Aprender docker en 14min]]
* Dockerfile
** Conceptos
** Comandos básicos
*** (BUILD) Crear Imagen
    La idea del dockerfile es crear imagenes, para luego crear contenedores

    #+NAME: Crear imagen
    #+BEGIN_SRC sh
      # usamos el comando build
      # seguido del parámetro -t
      # seguido de la imagen y un tag que especifique la versión (opcional)
      # por último la ruta donde está el Dockerfile, si se deja el punto se refiere a la ruta actual
      docker build -t nombreImagen:algunTag .
    #+END_SRC
*** (COPY) Copiar archivos
    - A diferencia del comando *ADD* no descomprime los archivos (Ej. .jar, .gz,..) que quizás no es la intención, 
    y los mueve a la ruta destino.

    #+NAME: docker-comando-copy
    #+BEGIN_SRC sh
      FROM debian

      # resources/app.jar es una ruta que pertenece al host, son los archivos y directorios que queremos copiar
      # /app es una ruta que está dentro del contenedor de docker, es donde se copiarán los archivos
      COPY resources/app.jar /app

      # este comando se ejecuta al iniciar el contenedor
      # y ejecuta el archivo .jar que copiamos al contenedor
      CMD ["java", "-jar", "app/app.jar"]
    #+END_SRC
