dist/guia-virtualizacion/docker.html
<div id="outline-container-org2f793b6" class="outline-4">
<h4 id="org2f793b6"><span class="section-number-4">1.8.3.</span> Referencias</h4>
</div>
</div>
<div id="outline-container-orgbd1adf0" class="outline-3">
<h3 id="orgbd1adf0"><span class="section-number-3">1.9.</span> Ejemplos</h3>
<div class="outline-text-3" id="text-1-9">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Creamos una red para conectar el contenedor</span>
docker network create --driver=bridge red-jelou

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">creamos el contenedor llamado prueba1 que tenga linux alpine edge</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">montamos un volumen llamado datos-jelou que usará</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">le asignamos la red que creamos previamente</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">y que ejecute el comando "sh" al iniciar (caso contrario no podemos acceder)</span>
docker run --name=prueba1 -it -v datos-jelou:/opt --network=red-jelou alpine:edge sh

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">analizamos el punto de montaje, osea donde se creó el volumen en el Host</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- el volumen se puede compartir entre otros contenedores</span>
docker volume inspect datos-jelou

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">analizamos la red,</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">que otros contenedores la utilizan</span>
docker network red-jelou

</pre>
</div>

<p>
Una breve explicación de los comandos ejecutados
</p>
<blockquote>
<p>
run
</p>

<p>
-it
</p>

<p>
-v jelou:/opt
</p>

<p>
–network=red-jelou
</p>

<p>
alpine:edge
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org723eb1f" class="outline-3">
<h3 id="org723eb1f"><span class="section-number-3">1.10.</span> Referencias</h3>
<div class="outline-text-3" id="text-1-10">
</div>
<div id="outline-container-org0d1443b" class="outline-4">
<h4 id="org0d1443b"><span class="section-number-4">1.10.1.</span> Referencias Web Extraoficiales</h4>
<div class="outline-text-4" id="text-1-10-1">
<ol class="org-ol">
<li><a href="https://docs.docker.com/develop/develop-images/dockerfile_best-practices/">Best practices for writing Dockerfiles - docs.docker.com</a></li>
<li><a href="https://docs.docker.com/engine/reference/commandline/container_prune/">https://docs.docker.com/engine/reference/commandline/container_prune/</a></li>
<li><a href="https://github.com/rocker-org/rocker/wiki/How-to-save-data">How to save data - github.com/rocker-org</a></li>
<li><a href="https://www.digitalocean.com/community/tutorials/como-instalar-y-usar-docker-en-ubuntu-18-04-1-es">Como instalar y usar Docker en Ubuntu 18.04 - Digitalocean.com</a></li>
<li><a href="https://www.ionos.es/digitalguide/servidores/configuracion/tutorial-docker-instalacion-y-primeros-pasos/">Tutorial Docker - Instalación y primeros pasos - Ionos.es</a></li>
<li><a href="https://colorfield.be/blog/cleaning-lando-containers">Cleaning up containers - colorfield.de</a></li>
<li><a href="https://blog.hipolabs.com/understanding-docker-without-losing-your-shit-cf2b30307c63">Understanding Docker - Blog hipolabs</a></li>
<li><a href="https://docs.docker.com/engine/reference/commandline/commit/">Docker commit - Docker.com</a></li>
</ol>
</div>
</div>
<div id="outline-container-org1c3378f" class="outline-4">
<h4 id="org1c3378f"><span class="section-number-4">1.10.2.</span> Referencias Issues</h4>
<div class="outline-text-4" id="text-1-10-2">
<ol class="org-ol">
<li><a href="https://stackoverflow.com/questions/21871479/docker-cant-connect-to-docker-daemon">Docker Can't connect to docker daemon - Stackoverflow.com</a></li>
<li><a href="https://www.digitalocean.com/community/questions/how-to-fix-docker-got-permission-denied-while-trying-to-connect-to-the-docker-daemon-socket">Permission denied while trying to connect to Docker Daemon - Digitalocean.com</a></li>
</ol>
</div>
</div>
<div id="outline-container-org9b8ab44" class="outline-4">
<h4 id="org9b8ab44"><span class="section-number-4">1.10.3.</span> Referencias Youtube</h4>
<div class="outline-text-4" id="text-1-10-3">
<ol class="org-ol">
<li><a href="https://www.youtube.com/watch?v=r6bxsuDq6wY&amp;list=PLmBbXLdrZ-O3B3rsLOVHufTL_wmickgLf&amp;ab_channel=ServersforHackers">Playlist #1</a></li>
<li><a href="https://www.youtube.com/watch?v=jjuIEHhXX7k&amp;list=PLmBbXLdrZ-O0GxzRkPdY6zUe9XRYNt38A&amp;ab_channel=ServersforHackers">Playlist #2</a></li>
<li><a href="https://www.youtube.com/watch?v=PbiYll21Jxg&amp;list=PLZdsdjcJ44WU_cY2Y1LFLnmsSjFD5BZLZ">Playlist - Docker container course (el mejor por ahora)</a></li>
<li><a href="https://www.youtube.com/watch?v=vjnOIE-CwMU&amp;list=PLqRCtm0kbeHAep1hc7yW-EZQoAJqSTgD-&amp;index=2">Video - Docker - primeros pasos</a></li>
<li><a href="https://www.youtube.com/watch?v=6idFknRIOp4&amp;t=201s">Video - Aprender docker en 14min</a></li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-org372018c" class="outline-2">
<h2 id="org372018c"><span class="section-number-2">2.</span> Dockerfile</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org1ddf6c6" class="outline-3">
<h3 id="org1ddf6c6"><span class="section-number-3">2.1.</span> Conceptos</h3>
</div>
<div id="outline-container-orgd2f6f50" class="outline-3">
<h3 id="orgd2f6f50"><span class="section-number-3">2.2.</span> Comandos básicos</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orga661aa3" class="outline-4">
<h4 id="orga661aa3"><span class="section-number-4">2.2.1.</span> (BUILD) Crear Imagen</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
La idea del dockerfile es crear imagenes, para luego crear contenedores
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org0dcb8d8"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">usamos el comando build</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">seguido del parámetro -t</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">seguido de la imagen y un tag que especifique la versión (opcional)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">por último la ruta donde está el Dockerfile, si se deja el punto se refiere a la ruta actual</span>
docker build -t nombreImagen:algunTag .
</pre>
</div>
</div>
</div>
<div id="outline-container-orga76df77" class="outline-4">
<h4 id="orga76df77"><span class="section-number-4">2.2.2.</span> (COPY) Copiar archivos</h4>
<div class="outline-text-4" id="text-2-2-2">
<ul class="org-ul">
<li>A diferencia del comando <b>ADD</b> no descomprime los archivos (Ej. .jar, .gz,..) que quizás no es la intención,</li>
</ul>
<p>
y los mueve a la ruta destino.
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org0a1292a">FROM debian

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">resources/app.jar es una ruta que pertenece al host, son los archivos y directorios que queremos copiar</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">/app es una ruta que está dentro del contenedor de docker, es donde se copiarán los archivos</span>
COPY resources/app.jar /app

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">este comando se ejecuta al iniciar el contenedor</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">y ejecuta el archivo .jar que copiamos al contenedor</span>
CMD <span style="color: #4f97d7;">[</span><span style="color: #2d9574;">"java"</span>, <span style="color: #2d9574;">"-jar"</span>, <span style="color: #2d9574;">"app/app.jar"</span><span style="color: #4f97d7;">]</span>
</pre>
</div>
</div>
</div>
