src/org-files/guia-virtualizacion/docker.org
*** (ADD) Descargar y Descomprimir archivos
    - Puede descargar archivos de url de internet y agregarlos a una ruta del contenedor
    - Permite descomprimir archivos (comportamiento quizás no deseado si se confunde con el comando *COPY*) 

    #+NAME: dockerfile-comando-add
    #+BEGIN_SRC sh
      FROM alpine:edge

      # ADD rutaDelHost rutaEnElDocker
      # 1. La primera ruta puede ser de un archivo, o directorio del Host,
      # es el que vamos a copiar al Contenedor
      # 2. La segunda ruta, está dentro del contenedor, y es donde copiaremos los archivos
      ADD default /etc/ngnix/sites-available/default
      ADD php-conf.conf /etc/php/7.2/php-conf.conf
    #+END_SRC

    #+BEGIN_EXAMPLE
    Una breve explicación del código anterior

    1. El primer parámetro de ADD es la ruta origen del HOST, es decir el ordendor donde ejecutamos nuestro docker
    2. El segundo parámetro es la ruta destino al Contenedor, donde se agregarán los directorios/archivos
    #+END_EXAMPLE
*** (ENTRYPOINT) Pasar scripts por parámetro
    - Podemos ejecutar scripts que ejecuten comandos de configuración (Ej. apache, php, ...)

    #+NAME: dockerfile-comando-entrypoint
    #+BEGIN_SRC sh
      FROM alpine:edge

      # no es necesario especificar la extensión .sh
      ENTRYPOINT ["start-container"]
    #+END_SRC
   
    #+NAME: start-container.sh
    #+BEGIN_SRC sh
      #!/usr/bin/env bash

      # este script será ejecutado por la linea ENTRYPOINT en el Dockerfile

      # 1. Verificamos si existe el directorio composer en la ruta actual
      if [ ! -d ./composer ]; then
      # 2. Si no existe, lo creamos
          mkdir ./composer
      fi
      # 3. Le asignamos permisos de lectura y escritura
      chmod -R ugo+rw ./composer
    #+END_SRC
*** (CMD) Comandos por defecto
    - Se ejecuta mientras corre el contenedor
    - Para ejecutar varios comandos por defecto utilizar un arreglo entre corchetes
    - Si pasamos un parámetro al docker run o por la terminal, pisará el de CMD

    El siguiente sería un archivo Dockerfile con las configuraciones
    #+NAME: Dockerfile
    #+BEGIN_SRC sh
      FROM alpine:edge

      CMD echo "Hola"
      #CMD ["/bin/echo", "hola"]
      #CMD ["echo", "hola"]
    #+END_SRC
   
    Y luego desde la terminal podemos ejecutar los siguientes comandos
    #+NAME: ejemplo-dockerfile-cmd 
    #+BEGIN_SRC sh
      # para crear la imagen
      docker build -t miservidor .

      # para correr el contenedor en base a la imagen creada
      docker run -it miservidor
    #+END_SRC
*** (RUN) Ejecutar comandos
    - Para escribir varios comandos en una capa, utiliza el slash invertido

    #+BEGIN_COMMENT
    - Por cada linea que repitamos RUN, se creará una capa de..?
    #+END_COMMENT
   
    Supongamos que queremos un linux con la distribución ubuntu
    #+BEGIN_SRC shell
      FROM ubuntu:trusty

      RUN apt-get install -y emacs
    #+END_SRC
    
    Supongamos que queremos un linux con la distribución alpine
    #+BEGIN_SRC shell
      FROM alpine:edge

      RUN apk add --force emacs
    #+END_SRC
** Ejemplos
   Cada linea del Dockerfile es *cacheada* en memoria, por lo que si en una linea decimos que
   
   Utilidad del *slash invertido* es evitar tener varias *capas* que se guardan en caché, y luego generan problemas.

   Si por ejemplo en una linea hacemos que instale algunos paquetes (Ej. apt-get install git emacs vim) y 
   encima de esta linea agregamos que instale otros paquetes (Ej. apt-get install java haskell) 
   es posible que no se ejecute esta segunda
   
   #+NAME: ejemplo1-dockerfile
   #+BEGIN_SRC sh
      FROM ubuntu:trusty

      MANTAINER jelou

      RUN apt-get install -y \
          git emacs \
          && apt-get clean \
          && rm -rf /tmp/* /var/tmp/* \
                && echo "8.8.8.8 # google dns" >> /etc/hosts
      ADD ./images www/html/images

      EXPOSE 80
      CMD ["Hola"]
   #+END_SRC
* Docker Compose
** Conceptos
   - Manejar varios contenedores en un archivo
   - Se puede combinar con Dockerfile
