dist/guia-virtualizacion/docker.html
<div id="outline-container-org61585b1" class="outline-4">
<h4 id="org61585b1"><span class="section-number-4">2.2.3.</span> (ADD) Descargar y Descomprimir archivos</h4>
<div class="outline-text-4" id="text-2-2-3">
<ul class="org-ul">
<li>Puede descargar archivos de url de internet y agregarlos a una ruta del contenedor</li>
<li>Permite descomprimir archivos (comportamiento quizás no deseado si se confunde con el comando <b>COPY</b>)</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh" id="org740cd09">FROM alpine:edge

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">ADD rutaDelHost rutaEnElDocker</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">1. La primera ruta puede ser de un archivo, o directorio del Host,</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">es el que vamos a copiar al Contenedor</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">2. La segunda ruta, está dentro del contenedor, y es donde copiaremos los archivos</span>
ADD default /etc/ngnix/sites-available/default
ADD php-conf.conf /etc/php/7.2/php-conf.conf
</pre>
</div>

<pre class="example" id="org4c56784">Una breve explicación del código anterior

1. El primer parámetro de ADD es la ruta origen del HOST, es decir el ordendor donde ejecutamos nuestro docker
2. El segundo parámetro es la ruta destino al Contenedor, donde se agregarán los directorios/archivos
</pre>
</div>
</div>
<div id="outline-container-org4688a30" class="outline-4">
<h4 id="org4688a30"><span class="section-number-4">2.2.4.</span> (ENTRYPOINT) Pasar scripts por parámetro</h4>
<div class="outline-text-4" id="text-2-2-4">
<ul class="org-ul">
<li>Podemos ejecutar scripts que ejecuten comandos de configuración (Ej. apache, php, …)</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh" id="org8589926">FROM alpine:edge

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">no es necesario especificar la extensión .sh</span>
ENTRYPOINT <span style="color: #4f97d7;">[</span><span style="color: #2d9574;">"start-container"</span><span style="color: #4f97d7;">]</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh" id="org27317df"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">!/usr/bin/</span><span style="color: #4f97d7; font-weight: bold;">env</span><span style="color: #2aa1ae; background-color: #292e34;"> bash</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">este script será ejecutado por la linea ENTRYPOINT en el Dockerfile</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">1. Verificamos si existe el directorio composer en la ruta actual</span>
<span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">[</span> <span style="color: #a45bad;">!</span> -d ./composer <span style="color: #4f97d7;">]</span>; <span style="color: #4f97d7; font-weight: bold;">then</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">2. Si no existe, lo creamos</span>
    mkdir ./composer
<span style="color: #4f97d7; font-weight: bold;">fi</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">3. Le asignamos permisos de lectura y escritura</span>
chmod -R ugo+rw ./composer
</pre>
</div>
</div>
</div>
<div id="outline-container-org10061df" class="outline-4">
<h4 id="org10061df"><span class="section-number-4">2.2.5.</span> (CMD) Comandos por defecto</h4>
<div class="outline-text-4" id="text-2-2-5">
<ul class="org-ul">
<li>Se ejecuta mientras corre el contenedor</li>
<li>Para ejecutar varios comandos por defecto utilizar un arreglo entre corchetes</li>
<li>Si pasamos un parámetro al docker run o por la terminal, pisará el de CMD</li>
</ul>

<p>
El siguiente sería un archivo Dockerfile con las configuraciones
</p>
<div class="org-src-container">
<pre class="src src-sh" id="orgb66ad16">FROM alpine:edge

CMD echo <span style="color: #2d9574;">"Hola"</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">CMD ["/bin/echo", "hola"]</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">CMD ["echo", "hola"]</span>
</pre>
</div>

<p>
Y luego desde la terminal podemos ejecutar los siguientes comandos
</p>
<div class="org-src-container">
<pre class="src src-sh" id="org443e36d"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">para crear la imagen</span>
docker build -t miservidor .

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">para correr el contenedor en base a la imagen creada</span>
docker run -it miservidor
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb1dbeec" class="outline-4">
<h4 id="orgb1dbeec"><span class="section-number-4">2.2.6.</span> (RUN) Ejecutar comandos</h4>
<div class="outline-text-4" id="text-2-2-6">
<ul class="org-ul">
<li>Para escribir varios comandos en una capa, utiliza el slash invertido</li>
</ul>

<p>
Supongamos que queremos un linux con la distribución ubuntu
</p>
<div class="org-src-container">
<pre class="src src-shell">FROM ubuntu:trusty

RUN apt-get install -y emacs
</pre>
</div>

<p>
Supongamos que queremos un linux con la distribución alpine
</p>
<div class="org-src-container">
<pre class="src src-shell">FROM alpine:edge

RUN apk add --force emacs
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge7188c1" class="outline-3">
<h3 id="orge7188c1"><span class="section-number-3">2.3.</span> Ejemplos</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Cada linea del Dockerfile es <b>cacheada</b> en memoria, por lo que si en una linea decimos que
</p>

<p>
Utilidad del <b>slash invertido</b> es evitar tener varias <b>capas</b> que se guardan en caché, y luego generan problemas.
</p>

<p>
Si por ejemplo en una linea hacemos que instale algunos paquetes (Ej. apt-get install git emacs vim) y 
encima de esta linea agregamos que instale otros paquetes (Ej. apt-get install java haskell) 
es posible que no se ejecute esta segunda
</p>

<div class="org-src-container">
<pre class="src src-sh" id="orgf51a0cf">FROM ubuntu:trusty

MANTAINER jelou

RUN apt-get install -y <span style="color: #2d9574;">\</span>
    git emacs <span style="color: #2d9574;">\</span>
    &amp;&amp; apt-get clean <span style="color: #2d9574;">\</span>
    &amp;&amp; rm -rf /tmp/* /var/tmp/* <span style="color: #2d9574;">\</span>
          &amp;&amp; <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"8.8.8.8 # google dns"</span> &gt;&gt; /etc/hosts
ADD ./images www/html/images

EXPOSE <span style="color: #a45bad;">80</span>
CMD <span style="color: #4f97d7;">[</span><span style="color: #2d9574;">"Hola"</span><span style="color: #4f97d7;">]</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org52bb493" class="outline-2">
<h2 id="org52bb493"><span class="section-number-2">3.</span> Docker Compose</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org7030f36" class="outline-3">
<h3 id="org7030f36"><span class="section-number-3">3.1.</span> Conceptos</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Manejar varios contenedores en un archivo</li>
<li>Se puede combinar con Dockerfile</li>
</ul>
</div>
</div>
