src/org-files/guia-virtualizacion/docker.org
** Instalación y Configuración
   #+BEGIN_QUOTE
   En la distribución Manjaro, intenté de instalar con ~pacman -S docker-compose~
   pero tiraba error por falta de packages. 
   
   Por tanto decidí realizar la instalación mediante ~pip install docker-compose~
   que tuvo éxito.
   #+END_QUOTE
   
   #+name: docker-compose-ejemplo
   #+BEGIN_SRC yaml
     # ES IMPORTANTE LA TABULACION, si no crashea
     version: "2.1"
     services:
       irc:
         # imagen que usará de base
         image: inspircd/inspircd-docker
         # le asignamos un nombre de referencia
         container_name: irc
         # puertos que usaremos
         # puertoHost:puertoContenedor
         # - puertoHost es el que usaremos en el host, donde corremos docker
         # - puertoContenedor el que usa la aplicación dentro del contenedor
         ports:
           - "6667:6667"
         # montamos un volumen, con directorios/archivos que apareceran en el contenedor
         # carpetaDelHost:rutaDelContenedor
         # - carpetaDelHost, contiene lo que aparecerá en el contenedor
         # - carpetaDelContenedor, es la carpeta que se creará y aparecerá en el contenedor
         volumes:
           - configs:/CONFIGURACIONES/
         # para configuraciones personalizadas
         environment:
           INSPIRCD_SERVER_NAME: "irc.localhost"
           INSPIRCD_SERVER_DESCRIPTION: "Probando..."
     # 
     volumes:
       configs:
   #+END_SRC
** Comandos Básicos 
   #+name: docker-compose-comandos
   #+BEGIN_SRC sh
     # corremos el docker-compose.yml de la ruta actual
     # up: crea el contenedor y lo ejecuta
     # -d: lo ejecuta en segundo plano
     # si no usamos -d, no podremos seguir utilizando la sesión de la terminal
     docker-compose up -d

     # acceder via terminal
     # en compose-docker los contenedores son servicios
     docker-compose exec nombreDelServicio sh
     # alternativa
     docker-compose exec nombreDelServicio bash

     # muestra los contenedores (en la ruta actual)
     docker-composer ps
   #+END_SRC
** Ejemplos
   #+BEGIN_SRC yaml
     version: "2.1"
     services:
       # entramos con docker exec -it miServidorAlpine sh
       ngnix:
         image: nginx:alpine
         container_name: miServidorAlpine
         # restart: always
         ports:
           - "81:80"
         volumes:
           # - este volumen, se crea dentro de /var/lib/docker/volumes
           # y apunta a la ruta del contenedor que aparece seguido de los dos puntos 
           # - data hace referencia al volumen que configuramos al final de este archivo
            - data:/usr/share/nginx/html:ro
           # el directorio "application" tiene que estar en la misma ruta
           # que este archivo Docker-compose.yml
           #- ./application:/usr/share/nginx/html:ro
       # redis:
       #   image: redis:alpine
       #   networks:
       #     - appnet

     # networks:
     #   appnet:
     #     driver: "bridge"

     # se va a montar un volumen en la ruta de docker del host
     # el nombre tendrá como prefijo el nombre del directorio donde está este docker-compose
     # seguido del nombre que le asignemos, en este caso data
     volumes:
       data:
         driver: "local"
   #+END_SRC
** Referencias
*** Referencias Web Oficiales
    1. [[https://docs.docker.com/compose/gettingstarted/][Getting Started - docs.docker.com]]
*** Referencias Youtube
    1. [[https://www.youtube.com/watch?v=pxMCpYrnzwM][Todo sobre docker compose - Webinars con Agilia]]
    2. [[https://www.youtube.com/watch?v=G_-R2dz6T5U][Introduccion a Docker]]
*** Issues Comunes
    1. [[https://stackoverflow.com/questions/36249744/interactive-shell-using-docker-compose][Interactive Shell - stackoverflow.com]]
* Docker Tips
