dist/guia-virtualizacion/docker.html
<div id="outline-container-org9977f85" class="outline-3">
<h3 id="org9977f85"><span class="section-number-3">3.2.</span> Instalación y Configuración</h3>
<div class="outline-text-3" id="text-3-2">
<blockquote>
<p>
En la distribución Manjaro, intenté de instalar con <code>pacman -S docker-compose</code>
pero tiraba error por falta de packages. 
</p>

<p>
Por tanto decidí realizar la instalación mediante <code>pip install docker-compose</code>
que tuvo éxito.
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-yaml" id="org57433b5"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">ES IMPORTANTE LA TABULACION, si no crashea</span>
<span style="color: #7590db;">version</span>: <span style="color: #2d9574;">"2.1"</span>
<span style="color: #7590db;">services</span>:
  <span style="color: #7590db;">irc</span>:
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">imagen que usará de base</span>
    <span style="color: #7590db;">image</span>: inspircd/inspircd-docker
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">le asignamos un nombre de referencia</span>
    <span style="color: #7590db;">container_name</span>: irc
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">puertos que usaremos</span>
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">puertoHost:puertoContenedor</span>
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- puertoHost es el que usaremos en el host, donde corremos docker</span>
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- puertoContenedor el que usa la aplicación dentro del contenedor</span>
    <span style="color: #7590db;">ports</span>:
      - <span style="color: #2d9574;">"6667:6667"</span>
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">montamos un volumen, con directorios/archivos que apareceran en el contenedor</span>
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">carpetaDelHost:rutaDelContenedor</span>
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- carpetaDelHost, contiene lo que aparecerá en el contenedor</span>
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- carpetaDelContenedor, es la carpeta que se creará y aparecerá en el contenedor</span>
    <span style="color: #7590db;">volumes</span>:
      - configs:/CONFIGURACIONES/
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">para configuraciones personalizadas</span>
    <span style="color: #7590db;">environment</span>:
      <span style="color: #7590db;">INSPIRCD_SERVER_NAME</span>: <span style="color: #2d9574;">"irc.localhost"</span>
      <span style="color: #7590db;">INSPIRCD_SERVER_DESCRIPTION</span>: <span style="color: #2d9574;">"Probando..."</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span>
<span style="color: #7590db;">volumes</span>:
  <span style="color: #7590db;">configs</span>:
</pre>
</div>
</div>
</div>
<div id="outline-container-orgca1605b" class="outline-3">
<h3 id="orgca1605b"><span class="section-number-3">3.3.</span> Comandos Básicos</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-sh" id="org72d766d"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">corremos el docker-compose.yml de la ruta actual</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">up: crea el contenedor y lo ejecuta</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">-d: lo ejecuta en segundo plano</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">si no usamos -d, no podremos seguir utilizando la sesión de la terminal</span>
docker-compose up -d

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">acceder via terminal</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">en compose-docker los contenedores son servicios</span>
docker-compose exec nombreDelServicio sh
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">alternativa</span>
docker-compose exec nombreDelServicio bash

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">muestra los contenedores (en la ruta actual)</span>
docker-composer ps
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf20b43c" class="outline-3">
<h3 id="orgf20b43c"><span class="section-number-3">3.4.</span> Ejemplos</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #7590db;">version</span>: <span style="color: #2d9574;">"2.1"</span>
<span style="color: #7590db;">services</span>:
  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">entramos con docker exec -it miServidorAlpine sh</span>
  <span style="color: #7590db;">ngnix</span>:
    <span style="color: #7590db;">image</span>: nginx:alpine
    <span style="color: #7590db;">container_name</span>: miServidorAlpine
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">restart: always</span>
    <span style="color: #7590db;">ports</span>:
      - <span style="color: #2d9574;">"81:80"</span>
    <span style="color: #7590db;">volumes</span>:
      <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- este volumen, se crea dentro de /var/lib/docker/volumes</span>
      <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">y apunta a la ruta del contenedor que aparece seguido de los dos puntos </span>
      <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">- data hace referencia al volumen que configuramos al final de este archivo</span>
       - data:/usr/share/nginx/html:ro
      <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">el directorio "application" tiene que estar en la misma ruta</span>
      <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">que este archivo Docker-compose.yml</span>
      <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">- ./application:/usr/share/nginx/html:ro</span>
  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">redis:</span>
  <span style="color: #2aa1ae; background-color: #292e34;">#   </span><span style="color: #2aa1ae; background-color: #292e34;">image: redis:alpine</span>
  <span style="color: #2aa1ae; background-color: #292e34;">#   </span><span style="color: #2aa1ae; background-color: #292e34;">networks:</span>
  <span style="color: #2aa1ae; background-color: #292e34;">#     </span><span style="color: #2aa1ae; background-color: #292e34;">- appnet</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">networks:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#   </span><span style="color: #2aa1ae; background-color: #292e34;">appnet:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#     </span><span style="color: #2aa1ae; background-color: #292e34;">driver: "bridge"</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">se va a montar un volumen en la ruta de docker del host</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">el nombre tendrá como prefijo el nombre del directorio donde está este docker-compose</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">seguido del nombre que le asignemos, en este caso data</span>
<span style="color: #7590db;">volumes</span>:
  <span style="color: #7590db;">data</span>:
    <span style="color: #7590db;">driver</span>: <span style="color: #2d9574;">"local"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3384603" class="outline-3">
<h3 id="org3384603"><span class="section-number-3">3.5.</span> Referencias</h3>
<div class="outline-text-3" id="text-3-5">
</div>
<div id="outline-container-org34cded0" class="outline-4">
<h4 id="org34cded0"><span class="section-number-4">3.5.1.</span> Referencias Web Oficiales</h4>
<div class="outline-text-4" id="text-3-5-1">
<ol class="org-ol">
<li><a href="https://docs.docker.com/compose/gettingstarted/">Getting Started - docs.docker.com</a></li>
</ol>
</div>
</div>
<div id="outline-container-orgf7f8751" class="outline-4">
<h4 id="orgf7f8751"><span class="section-number-4">3.5.2.</span> Referencias Youtube</h4>
<div class="outline-text-4" id="text-3-5-2">
<ol class="org-ol">
<li><a href="https://www.youtube.com/watch?v=pxMCpYrnzwM">Todo sobre docker compose - Webinars con Agilia</a></li>
<li><a href="https://www.youtube.com/watch?v=G_-R2dz6T5U">Introduccion a Docker</a></li>
</ol>
</div>
</div>
<div id="outline-container-org3f1e9e9" class="outline-4">
<h4 id="org3f1e9e9"><span class="section-number-4">3.5.3.</span> Issues Comunes</h4>
<div class="outline-text-4" id="text-3-5-3">
<ol class="org-ol">
<li><a href="https://stackoverflow.com/questions/36249744/interactive-shell-using-docker-compose">Interactive Shell - stackoverflow.com</a></li>
</ol>
</div>
</div>
</div>
</div>
