src/org-files/guia-virtualizacion/docker.org
** Ejecutar contenedores al iniciar el sistema
   Si tenemos algún problema en nuestro ordenador (se reinicia, se apaga, cuelga, error, etc..)
   podemos usar el parámetro ~always~

   #+NAME: docker-compose
   #+BEGIN_SRC yaml
     version: "3.9"
     services:
       redis:
         image: redis:alpine
         # se reinicia con un máximo de 10 intentos
         restart: on-failure:10
       ngnix:
         image: ngnix:alpine
         # se reinicia siempre
         restart: always
   #+END_SRC
** Conocer el timestamp de los logs
   Con el comando ~docker logs nombreContenedor~ nos muestra un historial de logs del contenedor,
   pero podemos conocer en detalle cuando sucedió utilizando el parámetro ~t~
  
   #+NAME: docker-logs-timestamp 
   #+BEGIN_SRC sh 
     docker logs --tail=10 -t nombreAlgunContenedor

     # con --tail=10, indicamos que nos muestre los últimos 10 eventos del historial de logs
     # con -t, indicamos que queremos conocer el timestamp de cada evento sucedido
   #+END_SRC
* Servicios Básicos
** Nginx
  Como servidor http, similar a apache2 pero con menos configuración
** Duckdns 
*** Conceptos
   - duckdns para enmascarar por asi decir la ip, como no-ip
*** Referencias
    - [[https://www.duckdns.org/][Duckdns - Sitio Oficial]]
    - [[https://hub.docker.com/r/linuxserver/duckdns/][DuckDns - hub.docker.com]]
** Inspircd
*** Conceptos
    Para crear un servidor irc
*** Referencias Web Oficiales
    1. [[https://github.com/inspircd/inspircd-docker][Inspircd Docker - hub.docker.com]]
    2. [[https://github.com/inspircd/inspircd-docker][Inspircd - github.com]]
*** Referencias Youtube
    1. [[https://www.youtube.com/watch?v=67f9iptWqt0&t=492s][Host a Deep web IRC Server - youtube.com]]
* Glosario
  1. Daemon
  2. Curl
  3. Sandbox
  4. Kubernetes
  5. Timestamp
  6. Runtime cpu
