dist/guia-virtualizacion/docker.html
<div id="outline-container-orgb7654c8" class="outline-2">
<h2 id="orgb7654c8"><span class="section-number-2">4.</span> Docker Tips</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orged20ca1" class="outline-3">
<h3 id="orged20ca1"><span class="section-number-3">4.1.</span> Ejecutar contenedores al iniciar el sistema</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Si tenemos algún problema en nuestro ordenador (se reinicia, se apaga, cuelga, error, etc..)
podemos usar el parámetro <code>always</code>
</p>

<div class="org-src-container">
<pre class="src src-yaml" id="orgeacb32f"><span style="color: #7590db;">version</span>: <span style="color: #2d9574;">"3.9"</span>
<span style="color: #7590db;">services</span>:
  <span style="color: #7590db;">redis</span>:
    <span style="color: #7590db;">image</span>: redis:alpine
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">se reinicia con un máximo de 10 intentos</span>
    <span style="color: #7590db;">restart</span>: on-failure:10
  <span style="color: #7590db;">ngnix</span>:
    <span style="color: #7590db;">image</span>: ngnix:alpine
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">se reinicia siempre</span>
    <span style="color: #7590db;">restart</span>: always
</pre>
</div>
</div>
</div>
<div id="outline-container-org71cbf31" class="outline-3">
<h3 id="org71cbf31"><span class="section-number-3">4.2.</span> Conocer el timestamp de los logs</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Con el comando <code>docker logs nombreContenedor</code> nos muestra un historial de logs del contenedor,
pero podemos conocer en detalle cuando sucedió utilizando el parámetro <code>t</code>
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org4540e7e">docker logs --tail=<span style="color: #a45bad;">10</span> -t nombreAlgunContenedor

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">con --tail=10, indicamos que nos muestre los últimos 10 eventos del historial de logs</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">con -t, indicamos que queremos conocer el timestamp de cada evento sucedido</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org2d4ac57" class="outline-2">
<h2 id="org2d4ac57"><span class="section-number-2">5.</span> Servicios Básicos</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgddeca2d" class="outline-3">
<h3 id="orgddeca2d"><span class="section-number-3">5.1.</span> Nginx</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Como servidor http, similar a apache2 pero con menos configuración
</p>
</div>
</div>
<div id="outline-container-org8e5bc7e" class="outline-3">
<h3 id="org8e5bc7e"><span class="section-number-3">5.2.</span> Duckdns</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-orgeedabef" class="outline-4">
<h4 id="orgeedabef"><span class="section-number-4">5.2.1.</span> Conceptos</h4>
<div class="outline-text-4" id="text-5-2-1">
<ul class="org-ul">
<li>duckdns para enmascarar por asi decir la ip, como no-ip</li>
</ul>
</div>
</div>
<div id="outline-container-org95154af" class="outline-4">
<h4 id="org95154af"><span class="section-number-4">5.2.2.</span> Referencias</h4>
<div class="outline-text-4" id="text-5-2-2">
<ul class="org-ul">
<li><a href="https://www.duckdns.org/">Duckdns - Sitio Oficial</a></li>
<li><a href="https://hub.docker.com/r/linuxserver/duckdns/">DuckDns - hub.docker.com</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2c64158" class="outline-3">
<h3 id="org2c64158"><span class="section-number-3">5.3.</span> Inspircd</h3>
<div class="outline-text-3" id="text-5-3">
</div>
<div id="outline-container-org4f9f753" class="outline-4">
<h4 id="org4f9f753"><span class="section-number-4">5.3.1.</span> Conceptos</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
Para crear un servidor irc
</p>
</div>
</div>
<div id="outline-container-org06f2976" class="outline-4">
<h4 id="org06f2976"><span class="section-number-4">5.3.2.</span> Referencias Web Oficiales</h4>
<div class="outline-text-4" id="text-5-3-2">
<ol class="org-ol">
<li><a href="https://github.com/inspircd/inspircd-docker">Inspircd Docker - hub.docker.com</a></li>
<li><a href="https://github.com/inspircd/inspircd-docker">Inspircd - github.com</a></li>
</ol>
</div>
</div>
<div id="outline-container-orgecf86aa" class="outline-4">
<h4 id="orgecf86aa"><span class="section-number-4">5.3.3.</span> Referencias Youtube</h4>
<div class="outline-text-4" id="text-5-3-3">
<ol class="org-ol">
<li><a href="https://www.youtube.com/watch?v=67f9iptWqt0&amp;t=492s">Host a Deep web IRC Server - youtube.com</a></li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-org6d97046" class="outline-2">
<h2 id="org6d97046"><span class="section-number-2">6.</span> Glosario</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>Daemon</li>
<li>Curl</li>
<li>Sandbox</li>
<li>Kubernetes</li>
<li>Timestamp</li>
<li>Runtime cpu</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: jelou</p>
<p class="date">Created: 2021-10-19 mar 03:18</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>


</body></html>